<div class="alert alert-block alert-success">
    <h1 align="center"> Naive Bayse (Social Network Ads Dataset) </h1>
    <h3 align="center"><a href="https://github.com/amirhosein-ziaei">Amirhosein Ziaei</a></h3>
</div>

## What is Naive Bayes?

Naive Bayes is a **classification** algorithm that works based on the Bayes theorem. Before explaining about Naive Bayes, first, we should discuss Bayes Theorem. Bayes theorem is used to find the probability of a hypothesis with given evidence.

<p align="center">
    <img src="images/naive-bayse.png" width="680"\>
</p>

In this, using Bayes theorem we can find the probability of A, given that B occurred.

> A is the hypothesis and B is the evidence.

> P(B|A) is the probability of B given that A is True.

> P(A) and P(B) is the independent probabilities of A and B.

## The concept behind the algorithm

Let’s understand the concept of the Naive Bayes Theorem through an example. We are taking a dataset of employees in a company, our aim is to create a model to find whether a person is going to the office by driving or walking using salary and age of the person.

<p align="center">
    <img src="images/data_1.png" width="680"\>
</p>

* Note that we are taken age on the X-axis and Salary on the Y-axis.

In the above, we can see 30 data points in which red points belong to those who are walking and green belongs to those who are driving.

<p align="center">
    <img src="images/bayse_1.png" width="680"\>
</p>

Now let’s add a new data point into it. Our aim is to find the category that the new point belongs to.

<p align="center">
    <img src="images/bayse_2.png" width="680"\>
</p>

## *Importing Libraries*

In [44]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import sklearn
import warnings
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler
from sklearn.naive_bayes import GaussianNB
warnings.filterwarnings('ignore')

## *Importing Dataset*

We are using the Social network ad dataset. The dataset contains the details of users in a social networking site to find whether a user buys a product by clicking the ad on the site based on their salary, age, and gender.

In [23]:
df = pd.read_csv('Dataset/Social_Network_Ads.csv')

## *Exploratory Data Analysis and Visualization*

In [24]:
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User ID          400 non-null    int64
 1   Gender           400 non-null    object
 2   Age              400 non-null    int64
 3   EstimatedSalary  400 non-null    int64
 4   Purchased        400 non-null    int64
dtypes: int64(4), object(1)
memory usage: 15.8+ KB

In [26]:
pd.crosstab(df.Gender,df.Purchased)

Purchased    0   1
Gender
Female     127  77
Male       130  66

In [27]:
df['Gender'].value_counts()

Female    204
Male      196
Name: Gender, dtype: int64

In [28]:
df.describe()

            User ID         Age  EstimatedSalary   Purchased
count  4.000000e+02  400.000000       400.000000  400.000000
mean   1.569154e+07   37.655000     69742.500000    0.357500
std    7.165832e+04   10.482877     34096.960282    0.479864
min    1.556669e+07   18.000000     15000.000000    0.000000
25%    1.562676e+07   29.750000     43000.000000    0.000000
50%    1.569434e+07   37.000000     70000.000000    0.000000
75%    1.575036e+07   46.000000     88000.000000    1.000000
max    1.581524e+07   60.000000    150000.000000    1.000000

| Question      |Answer
| :---        |    :----:   
| Number of Instances      | 400       
| Number of Features   | 3
| Class Distribution      | 257 No, 143 Yes
| Number of Missing Values      | 0       
| Number of Classes      | 2       
| Task   | Classification

## *Data Preprocessing*

### *Train Data*

In [29]:
X = df.iloc[:, [1, 2, 3]]
y = df.iloc[:, -1]

In [30]:
X

     Gender  Age  EstimatedSalary
0      Male   19            19000
1      Male   35            20000
2    Female   26            43000
3    Female   27            57000
4      Male   19            76000
..      ...  ...              ...
395  Female   46            41000
396    Male   51            23000
397  Female   50            20000
398    Male   36            33000
399  Female   49            36000

[400 rows x 3 columns]

In [31]:
y

0      0
1      0
2      0
3      0
4      0
      ..
395    1
396    1
397    1
398    0
399    1
Name: Purchased, Length: 400, dtype: int64

### *Label Encoder*

In [32]:
le = LabelEncoder()
X['Gender'] = le.fit_transform(X['Gender'])

In [33]:
X

     Gender  Age  EstimatedSalary
0         1   19            19000
1         1   35            20000
2         0   26            43000
3         0   27            57000
4         1   19            76000
..      ...  ...              ...
395       0   46            41000
396       1   51            23000
397       0   50            20000
398       1   36            33000
399       0   49            36000

[400 rows x 3 columns]

In [34]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.20, random_state = 0)

### *Feature Scaling*

In [41]:
sc = StandardScaler()
X_train = pd.DataFrame(sc.fit_transform(X_train))
X_test = sc.transform(X_test)

In [42]:
X_train.head(1)

         0        1         2
0  1.02532  1.92295  2.146016

In [43]:
X_train[0]

0      1.025320
1     -0.975305
2     -0.975305
3     -0.975305
4     -0.975305
         ...
315   -0.975305
316    1.025320
317    1.025320
318   -0.975305
319   -0.975305
Name: 0, Length: 320, dtype: float64

## *Train Model*

In [45]:
classifier = GaussianNB()
classifier.fit(X_train, y_train)

GaussianNB()

In [46]:
y_pred  =  classifier.predict(X_test)

In [47]:
y_pred

array([0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1,
       0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0,
       1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1,
       0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1], dtype=int64)